{"pageProps":{"source":{"compiledSource":"var o=Object.defineProperty,m=Object.defineProperties;var p=Object.getOwnPropertyDescriptors;var a=Object.getOwnPropertySymbols;var s=Object.prototype.hasOwnProperty,l=Object.prototype.propertyIsEnumerable;var d=(n,i,t)=>i in n?o(n,i,{enumerable:!0,configurable:!0,writable:!0,value:t}):n[i]=t,e=(n,i)=>{for(var t in i||(i={}))s.call(i,t)&&d(n,t,i[t]);if(a)for(var t of a(i))l.call(i,t)&&d(n,t,i[t]);return n},u=(n,i)=>m(n,p(i));var g=(n,i)=>{var t={};for(var r in n)s.call(n,r)&&i.indexOf(r)<0&&(t[r]=n[r]);if(n!=null&&a)for(var r of a(n))i.indexOf(r)<0&&l.call(n,r)&&(t[r]=n[r]);return t};const layoutProps={},MDXLayout=\"wrapper\";function MDXContent(t){var r=t,{components:n}=r,i=g(r,[\"components\"]);return mdx(MDXLayout,u(e(e({},layoutProps),i),{components:n,mdxType:\"MDXLayout\"}),mdx(\"h1\",e({},{id:\"modul-10---qgis-erweiterungen---plugins\"}),mdx(\"a\",e({parentName:\"h1\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#modul-10---qgis-erweiterungen---plugins\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Modul 10 - QGIS-Erweiterungen / -Plugins\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Autor:in\"),\": Codrina\"),mdx(\"h2\",e({},{id:\"p\\xE4dagogische-einf\\xFChrung\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#p\\xE4dagogische-einf\\xFChrung\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"P\\xE4dagogische Einf\\xFChrung\"),mdx(\"p\",null,`In diesem Modul werden einige der interessantesten und hoffentlich n\\xFCtzlichen Erweiterungen vorgestellt, die von der internationalen QGIS-Gemeinschaft entwickelt und f\\xFCr jedermann zur Verf\\xFCgung gestellt wurden. Wir werden dabei den Begriff Plugin und Erweiterung austauschbar benutzen - Die deutsche QGIS-Oberfl\\xE4che nutzt haupts\\xE4chlich den Begriff Erweiterungen, da viele der Erweiterungen aber nicht lokalisiert sind, tauchen sie h\\xE4ufig auch unter dem internationalen Namen - Plugins - auf.\nAm Ende des Moduls sollten Sie wissen:`),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Wie man ein neues Plugin sucht und installiert\"),mdx(\"li\",{parentName:\"ul\"},\"Wie man zwischen den verschiedenen Plugin-Repositories wechselt\"),mdx(\"li\",{parentName:\"ul\"},\"Wie man eine Plugin-Dokumentation liest und worauf man achten muss.\")),mdx(\"h2\",e({},{id:\"erforderliche-tools-und-ressourcen\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#erforderliche-tools-und-ressourcen\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Erforderliche Tools und Ressourcen\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Dieses Modul wurde mit \",mdx(\"a\",e({parentName:\"li\"},{href:\"https://qgis.org/en/site/forusers/download.html\"}),\"QGIS Version 3.16.1 - Hannover\"),\" erstellt.\")),mdx(\"h2\",e({},{id:\"voraussetzungen\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#voraussetzungen\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Voraussetzungen:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Grundkenntnisse in der Bedienung eines Computers\"),mdx(\"li\",{parentName:\"ul\"},\"Ein solides Verst\\xE4ndnis aller Module, da die Plugins, die wir vorstellen werden, sich auf verschiedene Begriffe/Elemente beziehen, die Sie im Laufe dieses Curriculums kennengelernt haben, wie z.B. Vektoren, Raster, Attributtabellen und viele andere.\")),mdx(\"h2\",e({},{id:\"hauptinhalt\"}),mdx(\"a\",e({parentName:\"h2\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#hauptinhalt\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Hauptinhalt\"),mdx(\"h3\",e({},{id:\"teil-1-einf\\xFChrung-in-den-plugin-gedanken\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#teil-1-einf\\xFChrung-in-den-plugin-gedanken\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Teil 1: Einf\\xFChrung in den Plugin-Gedanken\"),mdx(\"p\",null,\"Einer der vielen Vorteile der Open-Source-Gemeinschaft - sowohl f\\xFCr Entwickler:innen als auch f\\xFCr Anwender:innen - ist die unglaubliche Geschwindigkeit, mit der Entwicklungen und Verbesserungen stattfinden, die Art und Weise, wie neue Ideen aufkommen und dann in die Praxis umgesetzt werden.\"),mdx(\"p\",null,'Wie Sie in Modul 1 gesehen haben, ist QGIS mit einer \"Plugin\"-Architektur konzipiert, die es erlaubt, es durch Hinzuf\\xFCgen externer Plugins leicht an die eigenen Bed\\xFCrfnisse anzupassen. In QGIS Unterscheidet man zwischen ',mdx(\"strong\",{parentName:\"p\"},\"Kern-\"),\" und \",mdx(\"strong\",{parentName:\"p\"},\"externen Plugins\"),\". Die Kern-Plugins - wie der Name schon sagt - bilden die Hauptstruktur, sie werden vom QGIS-Entwicklungsteam gewartet und sind immer in der Installation enthalten. Beispiele sind die wie z.B. das Processing-Kern-Plugin, die Zonale Statistik oder der Plugin-Manager. Im Laufe der Zeit sind verschiedene externe Plugins aufgrund ihrer Relevanz in Richtung des Kerns gewandert.\"),mdx(\"p\",null,\"Nat\\xFCrlich kann man angesichts der Open-Source-Prinzipien, gepaart mit den gro\\xDFartigen und sehr detaillierten Dokumentationen, die zur Verf\\xFCgung stehen, und den vielen Kommunikationskan\\xE4len und speziellen Veranstaltungen lernen, wie man ein Plugin baut, das den eigenen Anforderungen entspricht. Und das ist ein \",mdx(\"strong\",{parentName:\"p\"},\"externes Plugin\"),\". Auf der dedizierten \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://plugins.qgis.org/\"}),\"Webseite\"),\" finden Sie die gesamte notwendige Dokumentation. Die meisten externen Plugins sind in Python geschrieben, aber sie k\\xF6nnen auch in C++ geschrieben werden.\"),mdx(\"p\",null,\"In dieser ersten Phase werden wir uns mit der Einrichtung von QGIS-Plugins besch\\xE4ftigen - wie man nach einem Plugin sucht, um eine bestimmte Anforderung zu l\\xF6sen, die man vielleicht hat, wie man dessen Dokumentation interpretiert und wie man dem Entwicklungsteam meldet, wenn man auf ein Problem gesto\\xDFen ist.\"),mdx(\"h3\",e({},{id:\"die-erweiterungsverwaltung\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#die-erweiterungsverwaltung\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Die Erweiterungsverwaltung\"),mdx(\"p\",null,\"QGIS bietet ein Kern-Plugin, mit dem externe Plugins verwaltet, installiert, aktualisiert und deinstalliert werden k\\xF6nnen. Die Funktionalit\\xE4t ist intuitiv und bietet vollen Zugriff auf das offizielle \\xF6ffentliche Plugin-Repository.\"),mdx(\"p\",null,\"Es muss betont werden, dass die externen Plugins - seien sie offiziell oder experimentell - die Arbeit einzelner Entwickler:innen oder Organisationen sind und die QGIS-Organisation keine Verantwortung f\\xFCr sie \\xFCbernimmt. Davon abgesehen gibt es einige Regeln, die Entwickler:innen, die ihre Arbeit \\xFCber das offizielle Repository zur Verf\\xFCgung stellen wollen, einhalten m\\xFCssen, sowie eine Reihe von Empfehlungen f\\xFCr eine schnelle Akzeptanz. Zu den Anforderungen geh\\xF6ren Elemente wie eine kompatible Lizenz, minimale Dokumentation, klare Identifizierung von Abh\\xE4ngigkeiten und andere. Zu den Empfehlungen geh\\xF6rt die \\xDCberpr\\xFCfung, ob das Plugin keine bestehende Funktionalit\\xE4t dupliziert, eine gute Struktur des Quellcode-Repositorys, Kompatibilit\\xE4t mit allen Plattformen (Windows, Linux, macOS) und viele andere.\"),mdx(\"p\",null,'Experimentelle Plugins - die im Plugin-Manager als solche gekennzeichnet sind - sind Plugins, die sich in einem fr\\xFChen Entwicklungsstadium befinden, also nicht f\\xFCr den operativen Einsatz geeignet sind. Sie gelten als \"Proof of Concept\"-Tests und es wird nicht empfohlen, sie zu installieren, es sei denn, man m\\xF6chte sie zu Testzwecken verwenden.'),mdx(\"p\",null,\"Um die experimentellen Plugins zu sehen, muss dies Funktionalit\\xE4t explizit eingeschaltet werden. Dies k\\xF6nnen Sie tun, indem Sie in den Einstellungen des Plugin-Managers die Option \",mdx(\"inlineCode\",{parentName:\"p\"},\"Auch experimentelle Erweiterungen anzeigen\"),\" ausw\\xE4hlen (Abbildung 10.2a). Es gibt auch die M\\xF6glichkeit, die veralteten Plugins aufzulisten. Diese werden nicht empfohlen, da sie nicht mehr gepflegt werden.\"),mdx(\"p\",null,\"Die beiden Typen werden im Plugin-Manager gut unterschieden (siehe Abbildungen 10.1 und 10.2b).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig101.png\",alt:\"alt_text\"}))),mdx(\"p\",null,\"Abbildung 10.1 - Alle Erweiterungen\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig102_a.png\",alt:\"alt_text\"}))),mdx(\"p\",null,\"Abbildung 10.2a - Anzeige experimenteller Plugins\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig102_b.png\",alt:\"alt_text\"}))),mdx(\"p\",null,\"Abbildung 10.2b - Eine Erweiterung mit experimenteller Version\"),mdx(\"p\",null,\"Ein weiterer erw\\xE4hnenswerter Aspekt ist, dass die Erweiterungsverwaltung eine recht vielseitige Funktionalit\\xE4t hat, die es Entwickler:innen erlaubt, ihre privaten Repositories hinzuzuf\\xFCgen (siehe Abbildung 10.3).\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig103.png\",alt:\"alt_text\"}))),mdx(\"p\",null,\"Abbildung 10.3 - Hinzuf\\xFCgen eines privaten Plugin-Repositorys zu QGIS\"),mdx(\"p\",null,\"Das ist n\\xFCtzlich, wenn z.B. innerhalb Ihrer Organisation ein Bedarf an weiteren Erweiterungen besteht, die aber nicht den Anforderungen von QGIS f\\xFCr das \\xF6ffentliche Hosting in ihrem offiziellen Repository entsprechen. Eine n\\xFCtzliche Ressource, wie Sie Ihr eigenes Plugin-Repository einrichten k\\xF6nnen, finden Sie auf \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://gis-ops.com/qgis-3-plugin-tutorial-set-up-a-plugin-repository-explained/\"}),\"GIS OPS (englischsprachig)\"),\".\"),mdx(\"p\",null,\"Die einfachere Methode besteht darin, ein Zip-Paket vorzubereiten, das eine Erweiterung enth\\xE4lt und das auf herk\\xF6mmliche Weise weitergegeben werden kann. Diese Methode ist jedoch nicht zu empfehlen.\"),mdx(\"p\",null,\"Nachdem Sie entschieden haben, welche Arten von Erweiterungen in Ihrem Manager aufgelistet werden sollen, k\\xF6nnen Sie auf die Registerkarte \",mdx(\"inlineCode\",{parentName:\"p\"},\"Alle\"),\" wechseln und genauer betrachten, wie eine Erweiterung im Plugin Manager erscheint. Suchen Sie zu Demonstrationszwecken das Plugin \",mdx(\"inlineCode\",{parentName:\"p\"},\"Cartographic Line Generalization\"),\".\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig104.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.4 - Suche nach einer bestimmten Erweiterung im Plugin-Manager\"),mdx(\"p\",null,\"Wie Sie sehen k\\xF6nnen, befindet sich auf der rechten Seite ein Fenster, das eine Reihe von Informationen anzeigt. Diese Informationen folgen f\\xFCr alle Erweiterungen dem gleichen Schema:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"Name der Erweiterung und Untertitel\"),mdx(\"li\",{parentName:\"ol\"},'Abschnitt \"Beschreibung\" - je nach Erweiterung kann dieser Abschnitt mehr oder weniger detailliert sein'),mdx(\"li\",{parentName:\"ol\"},\"Die Anzahl der Downloads und wie viele Sterne die Erweiterung von der Community erhalten hat\"),mdx(\"li\",{parentName:\"ol\"},\"Eine Reihe an Tags, die die Erweiterung kategorisieren\"),mdx(\"li\",{parentName:\"ol\"},\"Eine Reihe von wichtigen Links: die Webseite der Erweiterung, der \",mdx(\"strong\",{parentName:\"li\"},\"Bug-Tracker\"),\" und das Coderepositorium\"),mdx(\"li\",{parentName:\"ol\"},\"Der Name des/der Entwickler:in, sowie der angeschlossenen Organisation. Manchmal wird auch der Name des Projekts, in dem die Erweiterung entwickelt wurde, aufgef\\xFChrt\"),mdx(\"li\",{parentName:\"ol\"},\"Die Versionsnummer mit dem Hinweis \",mdx(\"em\",{parentName:\"li\"},\"stabil\"),\" oder \",mdx(\"em\",{parentName:\"li\"},\"experimentell\"),\", je nach Fall\"),mdx(\"li\",{parentName:\"ol\"},\"Das Logo der Erweiterung\")),mdx(\"p\",null,\"\\xDCber den Button \",mdx(\"inlineCode\",{parentName:\"p\"},\"Erweiterung installieren\"),\" k\\xF6nnen Sie die Erweiterung hinzuf\\xFCgen. Sie taucht dann meist als neuer Button in der QGIS-Oberfl\\xE4che auf.\"),mdx(\"p\",null,\"Aus Platzgr\\xFCnden ist die Beschreibung im Plugin-Manager meist recht kurz. Mehr Details zur Funktionalit\\xE4t des Plugins findet man \\xFCblicherweise auf der verlinkten Homepage. In unserem Fall stellen wir fest, dass die Homepage mit dem Coderepositorium identisch ist - auf Github, aber das ist nicht immer der Fall (siehe Abbildung 10.6).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig106_a.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.6a - Homepage des ausgew\\xE4hlten Plugins\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig106_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.6b - Detaillierte Metadaten auf der Plugin-Homepage\"),mdx(\"p\",null,\"Ein weiterer sehr wichtiger Aspekt, der bei der Dokumentation eines Plugins hervorzuheben ist, ist die Web-Anzeige des \",mdx(\"strong\",{parentName:\"p\"},\"Bug-Trackers\"),\" bzw der \",mdx(\"strong\",{parentName:\"p\"},\"Fehlerverfolgung\"),\". Ein Bug-Tracker-System ist eine Software-Anwendung, die alle gemeldeten Software-Probleme (\",mdx(\"em\",{parentName:\"p\"},\"Bugs\"),\") aufzeichnet. In unserem Fall wird der Bug Tracker durch das dedizierte Coderepositorium Github unterst\\xFCtzt (siehe Abbildung 10.7).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig107.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Figure 10.7 - Bug tracking system in Github for a QGIS plugin\"),mdx(\"p\",null,\"Es w\\xFCrde den Rahmen dieses Moduls sprengen, im Detail darauf einzugehen, wie man ein Software-Problem auf Github meldet, aber es ist wichtig, ein paar Aspekte hervorzuheben. Erstens funktioniert das Open-Source-\\xD6kosystem - sei es f\\xFCr Geodaten oder nicht - am besten, wenn alle Beteiligten ihren Teil aktiv beitragen, d.h. Entwickler:innen programmieren und Benutzer:innen testen und melden identifizierte Probleme zur\\xFCck. Wenn man einen Blick auf die Bug-Tracker f\\xFCr \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/qgis/QGIS/issues\"}),\"QGIS\"),\" oder \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/OSGeo/grass/issues\"}),\"GRASS\"),\" oder andere Open-Source-L\\xF6sungen wirft, wird man intensive Aktivit\\xE4t feststellen. Und das ist gut so, zeigt es doch, dass die Community lebendig ist, dass die Interaktion zwischen Entwickler:innen und Anwender:innen normal funktioniert. Um den Entwicklungsteams Arbeit abzunehmen, geh\\xF6rt es zum guten Ton, dass Sie - bevor sie einen neuen Bug melden - erst die bestehenden Bugs durchsuchen, um Duplikate zu vermeiden.\"),mdx(\"h4\",e({},{id:\"quizfragen\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#quizfragen\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),mdx(\"strong\",{parentName:\"h4\"},\"Quizfragen\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"Ben\\xF6tigen Sie den vollst\\xE4ndigen Namen der Erweiterung, um sie in der Erweiterungsverwaltung zu finden?\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"Nein, ein Stichwort reicht aus\")),mdx(\"li\",{parentName:\"ul\"},\"Ja\"))),mdx(\"li\",{parentName:\"ol\"},\"Sind sowohl die offiziellen als auch die experimentellen Erweiterungen im gleichen Repository verf\\xFCgbar?\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"Ja, sofern die Option 'Auch experimentelle Erweiterungen anzeigen' im Plugin-Manager ausgew\\xE4hlt ist.\")),mdx(\"li\",{parentName:\"ul\"},\"Nein, f\\xFCr experimentelle gibt es andere Repositories.\"))),mdx(\"li\",{parentName:\"ol\"},\"Nennen Sie 2 oder 3 Informationen, die in der Dokumentation einer Erweiterung zu finden sind:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Titel & Beschreibung, Anzahl der Downloads, Homepage, Links zum Code-Repository, Name des/der Entwickler:in, eine Kurzbeschreibung\")))),mdx(\"h3\",e({},{id:\"teil-2-einige-n\\xFCtzliche-qgis-erweiterungen-\"}),mdx(\"a\",e({parentName:\"h3\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#teil-2-einige-n\\xFCtzliche-qgis-erweiterungen-\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Teil 2: Einige n\\xFCtzliche QGIS-Erweiterungen \",\"*\",\"*\"),mdx(\"p\",null,\"Erweiterungen k\\xF6nnen auf unterschiedliche Arten klassifiziert werden. Im Folgenden identifizieren wir zwei M\\xF6glichkeiten:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Nach dem Stand der Entwicklung:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Offiziell - die Erweiterung wird als stabil angesehen, ist gut dokumentiert und kann in einem professionellen Kontext verwendet werden\"),mdx(\"li\",{parentName:\"ul\"},\"Experimentell - die Erweiterung befindet sich in einem fr\\xFChen Entwicklungsstadium, sie wird nur zu Testzwecken empfohlen\"),mdx(\"li\",{parentName:\"ul\"},\"Veraltet - die Erweiterung wird nicht mehr weiterentwickelt, d.h. sie wird nicht mehr auf neue Versionen aktualisiert, das Entwicklungsteam antwortet m\\xF6glicherweise nicht mehr auf Fehlerberichte. Diese Erweiterungen sollten nur verwendet werden, wenn es keine andere M\\xF6glichkeit gibt, das Problem zu l\\xF6sen.\"))),mdx(\"li\",{parentName:\"ul\"},\"Nach Kategorie-Typ:\",mdx(\"ul\",{parentName:\"li\"},mdx(\"li\",{parentName:\"ul\"},\"Vektor\"),mdx(\"li\",{parentName:\"ul\"},\"Raster\"),mdx(\"li\",{parentName:\"ul\"},\"Web\"),mdx(\"li\",{parentName:\"ul\"},\"Datenbank\"),mdx(\"li\",{parentName:\"ul\"},\"Kartographie\")))),mdx(\"p\",null,\"Einige externe Erweiterungen erlauben den Zugriff durch QGIS auf externe Datenbanken, Cloudspeicher und Dienste. In diesem Fall kann es zu zus\\xE4tzlichen Voraussetzungen kommen - z.B. ein bezahltes Konto f\\xFCr den externen Dienst oder den Cloudspeicher oder ein API-Schl\\xFCssel. Ein Beispiel zur Veranschaulichung ist die Erweiterung Planet Explorer von Planet Inc. (siehe Abbildung 10.8).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig108.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.8 - Beispiel f\\xFCr eine Erweiterung, die ein externes Abonnement ben\\xF6tigt, damit sie in QGIS in vollem Umfang funktioniert\"),mdx(\"p\",null,`Obwohl in der Beschreibung kein Hinweis darauf zu finden ist, offenbart ein Blick auf die Homepage der Erweiterung die Voraussetzungen, damit sie funktioniert: \"Planet subscription or trial for accessing and downloading Planet imagery. Don't have a subscription? Contact our `,mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.planet.com/contact/\"}),\"team\"),' to learn more\"'),mdx(\"p\",null,\"In den folgenden Abschnitten werden wir einige Erweiterungen, die unserer Meinung nach n\\xFCtzlich sein k\\xF6nnten, identifizieren und mit kurzen Beispielen versehen. Dies ist nat\\xFCrlich nur eine kurze Liste aus dem umfangreichen Universum der Erweiterungen, z\\xF6gern Sie nicht, dar\\xFCber hinaus zu gehen.\"),mdx(\"h4\",e({},{id:\"discoverz\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#discoverz\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),mdx(\"strong\",{parentName:\"h4\"},\"Discoverz\")),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig109_a.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,'Abbildung 10.9a - Die Erweiterung \"Discovery\"'),mdx(\"p\",null,\"Discovery ist eine sehr n\\xFCtzliche Erweiterung, mit der Sie in den Attributen Ihrer Vektordaten nach Text suchen k\\xF6nnen. Die Erweiterung verbindet sich entweder mit einer PostgreSQL/PostGIS-Datenbank, MS SQL Server oder einem Geopackage und sucht nach Text in den angegebenen Spalten.\"),mdx(\"p\",null,\"Um es zu testen, werden wir eine Geopackage-Datei verwenden, die vom Humanitarian Data Exchange vorbereitet wurde und zum \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://data.humdata.org/dataset/hotosm_phl_north_populated_places\"}),\"Download\"),\" zur Verf\\xFCgung steht. Es handelt sich um eine Vektordatei, die die besiedelten Orte von den Philippinen enth\\xE4lt, zusammen mit Namen und Anzahl der Menschen. Die Rohdaten wurden von OpenStreetMap heruntergeladen.\"),mdx(\"p\",null,\"Nachdem Sie die Erweiterungsverwaltung benutzt haben, um Discovery zu installieren, sollte eine neue Symbolleiste in Ihrem QGIS sichtbar sein. Lassen Sie uns die Parameter einrichten: Datenquellentyp: Geopackage, Name: Philippines, w\\xE4hlen Sie die Datei entsprechend aus und der Layer wird Populated Places sein, die Suchspalte: name. Wir werden auch zus\\xE4tzliche Informationen anfordern, die in der Suchleiste angezeigt werden sollen: is_in und population. Dadurch werden wir in der Lage sein, mehrere D\\xF6rfer mit demselben Namen zu unterscheiden, wenn diese in unterschiedlichen Provinzen liegen Ihr Discovery-Setup sollte wie in Abbildung 10.9b aussehen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig109_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,'Abbildung 10.9b - Einstellen der Erweiterung \"Discovery\"'),mdx(\"p\",null,'Klicken Sie auf OK und lassen Sie uns in der Suchleiste nach \"San Roque\" suchen (siehe Abbildung 10.9c).'),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig109_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.9c - Verwenden der Suche zum schnellen Durchsuchen der Attribute der Vektor-Layer.\"),mdx(\"p\",null,\"In unserem Beispiel k\\xF6nnen wir sehen, dass es viele Orte in San Roque auf den Philippinen gibt. W\\xE4hlen Sie einen Eintrag in dieser Liste aus und QGIS zoomt ihn heran (siehe Abbildung 10.9d).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig109_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.9d - Heranzoomen auf die Geometrie des ausgew\\xE4hlten Elements in der Suchleiste.\"),mdx(\"p\",null,\"Die Erweiterung bietet die M\\xF6glichkeit, Vektoren per Textsuche gekoppelt mit verschiedenen Filtern, wie z. B. einer Bounding Box, oder verschiedenen SQL-Abfragen zu finden.\"),mdx(\"p\",null,\"Eine ausf\\xFChrliche Beschreibung der F\\xE4higkeiten des Plugins sowie ein umfassenderes Tutorial finden Sie auf der \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.lutraconsulting.co.uk/projects/discovery/\"}),\"offiziellen Website (englischsprachig)\"),\".\"),mdx(\"h4\",e({},{id:\"polygon-divider\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#polygon-divider\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),mdx(\"strong\",{parentName:\"h4\"},\"Polygon Divider\")),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1010_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.10a - Die Erweiterung Polygon Divider\"),mdx(\"p\",null,'Polygon Divider ist eine weitere n\\xFCtzliche Erweiterung von QGIS, die es erm\\xF6glicht, einen Vektor-Layer vom Typ Polygon effizient in eine Anzahl von \"quadratischen\" Polygonen einer definierten Gr\\xF6\\xDFe zu unterteilen.'),mdx(\"p\",null,\"Dieses Werkzeug kann f\\xFCr eine Vielzahl von Anwendungen n\\xFCtzlich sein, z.B. f\\xFCr die Parzellierung von Grundst\\xFCcken, f\\xFCr Umweltproben und so weiter.\"),mdx(\"p\",null,\"Lassen Sie uns dieses Werkzeug auf unsere Region Mittelsachsen anwenden und sehen, welche Ergebnisse wir erhalten.\"),mdx(\"p\",null,\"Installieren Sie mit der Erweiterungsverwaltung den Polygon Divider. Nach der Fertigstellung erscheint ein neues Piktogramm in Ihrer QGIS-Symbolleiste und ein neues Fenster \\xF6ffnet sich (siehe Abbildung 10.10b).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1010_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,'Abbildung 10.10b - Fenster der Erweiterung \"Polygon Divider'),mdx(\"p\",null,\"W\\xE4hlen Sie als Eingabe-Layer den Polygon-Layer Mittelsachsen, speichern Sie die Ausgabedatei als Mittelsachsen_polygone, w\\xE4hlen Sie 1000000 (d.h. alle Teilungen werden etwa 100 Hektar gro\\xDF sein), w\\xE4hlen Sie als Schnittrichtung links nach rechts und die Toleranz 1. Das Ergebnis sollte wie in Abbildung 10.10c aussehen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1010_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.10c - Ergebnis der Ausf\\xFChrung der Erweiterung Polygon Divider auf dem Vektorlayer Mittelsachsen\"),mdx(\"p\",null,\"Eine ausf\\xFChrliche Beschreibung der F\\xE4higkeiten der Erweiterung sowie eine umfassendere Anleitung finden Sie auf der Polygon Divider \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/jonnyhuck/RFCL-PolygonDivider\"}),\"Website (englischsprachig)\"),\".\"),mdx(\"h4\",e({},{id:\"load-them-all\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#load-them-all\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Load Them All\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1011_a.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,'Abbildung 10.11a - Die Erweiterung \"Load Them All\"'),mdx(\"p\",null,\"Dies ist eine n\\xFCtzliche Erweiterung, wenn Sie mehrere Layer (Vektoren und Raster) haben, die Sie in QGIS laden m\\xFCssen. Die Erweiterung erlaubt es Ihnen, automatisch alle auf einmal zu laden, aber der gro\\xDFe Vorteil ist, dass es Ihnen eine Vielzahl von Filtern zur Verf\\xFCgung stellt, wie z.B. alphanumerisch (nach Namen), \\xC4nderungsdatum, Bounding Box (von Hand eingef\\xFCgte Koordinaten), Art der Geometrie usw.\"),mdx(\"p\",null,\"Um es zu testen, werden wir Dateien aus dem vorherigen Modul 8 laden. Unter den Vektordaten werden wir die Shapefiles ausw\\xE4hlen, die vor einem ausgew\\xE4hlten Datum bearbeitet wurden, bei den Raterdaten werden wir einen alphanumerischen Filter w\\xE4hlen - der Name des geladenen Rasters sollte mit LandCover beginnen (siehe Abbildung 10.11_b). Die Screenshots beziehen sich hier auf die Version dieses Trainings, die f\\xFCr die Philippinen erstellt wurde - Sie k\\xF6nnen nat\\xFCrlich analog f\\xFCr die deutschen Daten vorgehen.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1011_b.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Bild 10.11b - Einstellen der Parameter f\\xFCr die Erweiterung Load Them All (Vektoren und Raster)\"),mdx(\"p\",null,\"Die oben angegebenen Parameter stellen ein Beispiel auf der Grundlage der verf\\xFCgbaren Struktur dar. Sie k\\xF6nnen sie nach eigenem Ermessen auf der Grundlage Ihrer Dateien auf Ihrem Computer \\xE4ndern.\"),mdx(\"p\",null,\"Beachten Sie, dass nach Abschluss der\"),mdx(\"p\",null,\"Die Ergebnisse der Ausf\\xFChrung der Erweiterung Load Them All mit den oben genannten Parametern sind in Abbildung 10.11c (Vektoren) und 10.11d (Raster) dargestellt.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1011_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.11c - Verwendung der Erweiterung Load Them All zum Laden mehrerer Vektoren\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1011_d.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,'Bild 10.11d - Erweiterung \"Load Them All\" zum Laden mehrerer Raster'),mdx(\"p\",null,\"Eine ausf\\xFChrliche Beschreibung der Funktionen der Erweiterungen sowie eine umfassendere Anleitung finden Sie auf der Seite Load the All \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/gacarrillor/loadthemall\"}),\"Website (englischsprachig)\"),\".\"),mdx(\"h4\",e({},{id:\"raster-tracer\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#raster-tracer\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Raster Tracer\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1012_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Bild 10.12a - Die Erweiterung Raster tracer\"),mdx(\"p\",null,\"Der Raster Tracer kann eine sehr n\\xFCtzliche Erweiterung sein, wenn Sie Vektordaten aus einer nicht maschinenlesbaren Karte extrahieren wollen. Diese T\\xE4tigkeit wird in der Regel an gescannten \\xE4lteren topographischen Karten durchgef\\xFChrt, aus denen wir verschiedene Informationen extrahieren wollen, um sie in einem Informationssystem zu speichern, zu verarbeiten und zu visualisieren. Ein gutes Beispiel ist die Digitalisierung von topografischen Karten, um H\\xF6henlinien zu extrahieren und in einem GIS ein 3D-Modell des Reliefs zu erstellen.\"),mdx(\"p\",null,\"Obwohl dies heute, mit dem Aufkommen digitaler Gel\\xE4ndemodelle, die aus Satellitenbildern gewonnen werden, kein Thema mehr ist, wird die Digitalisierung immer noch ausgiebig genutzt. Die prominenteste Anwendung ist die Extraktion von Informationen aus alten Karten. Historische Karten bieten uns einen Einblick in die Zeit, bevor wir Satelliten hatten, um unsere W\\xE4lder und Landbedeckungsver\\xE4nderungen zu \\xFCberwachen. Da diese kartografischen Dokumente urspr\\xFCnglich auf Papier waren, muss man, um die Informationen mit moderner Technologie nutzen zu k\\xF6nnen, digitalisieren.\"),mdx(\"p\",null,\"Suchen Sie mit Hilfe der Erweiterungsverwaltung den Raster Tracer und installieren Sie ihn. Diese Erweiterung f\\xFCgt QGIS eine halbautomatische F\\xE4higkeit hinzu, Linienmerkmale der zugrundeliegenden Rasterkarte zu verfolgen, indem man auf ihre Wendepunkte auf der Rasterkarte klickt. Nach der Installation sollte ein neues Piktogramm in Ihrer Symbolleiste erscheinen.\"),mdx(\"p\",null,\"Um die Erweiterung verwenden zu k\\xF6nnen, ben\\xF6tigen wir mindestens 2 Layer - einen Raster-Layer und einen Vektor-Layer, der die Daten erfasst. Wir haben hier beispielhaft eine topographische Karte von den Philippinen, 1:50k auf der offiziellen Website der National Mapping and Resources Information Authority gefunden. Leider ist die \",mdx(\"a\",e({parentName:\"p\"},{href:\"http://www.namria.gov.ph/3131-IIIAngelesCity.html\"}),\"Karte\"),\" nicht georeferenziert. Zu Demonstrationszwecken machen wir weiter, ohne dieses Problem zu beheben, aber bitte beachten Sie: Vor der Digitalisierung von Vektoren aus einer Rasterkarte ist es entscheidend, dass diese korrekt georeferenziert ist. Andernfalls ist die - durchaus zeitaufwendige - Arbeit nutzlos.\"),mdx(\"p\",null,\"Bringen Sie also die topographische Karte von Angeles City ein (\",mdx(\"inlineCode\",{parentName:\"p\"},\"Layer - Layer hinzuf\\xFCgen - Rasterlayer hinzuf\\xFCgen...\"),\").\"),mdx(\"p\",null,\"Als n\\xE4chstes erstellen wir einen MultiString-Vektor-Layer, in dem alle Linienobjekte, die wir aus der topographischen Karte extrahieren, gespeichert werden (Layer - Layer erstellen - Neuer GeoPackage Layer..). Erstellen Sie einen MultiLine-Vektor und speichern Sie ihn unter dem Namen tracer_lines. W\\xE4hlen Sie die Projektion EPSG: 3123 - die offizielle Projektion der Region. Starten Sie den Bearbeitungsmodus darauf (\",mdx(\"inlineCode\",{parentName:\"p\"},\"Rechtsklick - Bearbeitungsstatus umschalten\"),\").\"),mdx(\"p\",null,\"Klicken Sie auf das Piktogramm RasterTracer und stellen Sie die Parameter ein, wie in Abbildung 10.12b. W\\xE4hlen Sie die Farbe der Konturlinien mit Hilfe des Farbw\\xE4hlers, der sich beim Anklicken der Option Trace color \\xF6ffnet.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1012_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.12b - Einstellen der RasterTracer-Parameter\"),mdx(\"p\",null,\"Jetzt m\\xFCssen Sie nur noch mit dem Digitalisieren beginnen. Nachdem Sie sich vergewissert haben, dass Ihr Vektorraster bearbeitbar ist und die Erweiterung durch erneutes Anklicken aktiviert ist, klicken Sie auf die Wendepunkte der Konturlinie, die wir extrahieren wollen (siehe Abbildung 10.112c).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1012_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.12c - Klicken auf die Wendepunkte zum Zeichnen der Linie mit RasterTracer\"),mdx(\"p\",null,\"Abbildung 10.12d zeigt das Ergebnis.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1012_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.12d - Halbautomatisch gezeichnete Linie durch Folgen der angegebenen Farbe.\"),mdx(\"h4\",e({},{id:\"active-fire\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#active-fire\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Active Fire\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1013_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,'Abbildung 10.13a - Die Erweiterung \"Active Fire\"'),mdx(\"p\",null,\"Erweiterungen sind nicht nur daf\\xFCr gedacht, mit Daten zu arbeiten, die Sie selbst haben, sondern auch, um Datens\\xE4tze einzubinden, die von anderen Institutionen oder Personen produziert und \\xFCber standardisierte Web-Mapping-Dienste zur Verf\\xFCgung gestellt werden.\"),mdx(\"p\",null,\"Ein gutes Beispiel ist die Erweiterung Active Fire. Dieses wurde entwickelt, um QGIS-Benutzer:innen die M\\xF6glichkeit zu geben, schnell, intuitiv und ohne jeglichen Aufwand Br\\xE4nde der letzten 24 Stunden in einer beliebigen Region von Interesse anzuzeigen. Die Feuerdaten werden von der NASA produziert und f\\xFCr jede:n frei verf\\xFCgbar gemacht. Die Rohdaten stammen von 2 Satelliten: dem Moderate Resolution Imaging Spectroradiometer (\",mdx(\"a\",e({parentName:\"p\"},{href:\"https://modis.gsfc.nasa.gov/\"}),\"MODIS\"),\") (\",mdx(\"a\",e({parentName:\"p\"},{href:\"https://earthdata.nasa.gov/earth-observation-data/near-real-time/firms/c6-mcd14dl\"}),\"MCD14DL\"),\") und der Visible Infrared Imaging Radiometer Suite (\",mdx(\"a\",e({parentName:\"p\"},{href:\"https://www.jpss.noaa.gov/viirs.html\"}),\"VIIRS\"),\") 375 m (\",mdx(\"a\",e({parentName:\"p\"},{href:\"https://earthdata.nasa.gov/earth-observation-data/near-real-time/firms/v1-vnp14imgt\"}),\"VNP14IMGTDL_NRT\"),\" und \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://earthdata.nasa.gov/earth-observation-data/near-real-time/firms/vj114imgtdl-nrt\"}),\"VJ114IMGTDL_NRT\"),\").\"),mdx(\"p\",null,\"Um sie zu finden, \\xF6ffnen Sie die Erweiterungsverwaltung und schreiben Sie fire. Nach der Installation erscheint ein neues rotes Piktogramm in Ihrer QGIS-Symbolleiste. Wenn Sie darauf klicken, erscheint ein neues Fenster, in dem Sie ausw\\xE4hlen k\\xF6nnen, von welchem Sensor Sie die Feuerpixel in den letzten 24 Stunden ermittelt haben wollen (siehe Abbildung 10.13b).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1013_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.13b - Verwendung der Erweiterung Active Fire zum Laden von NASA-Feuerprodukten in QGIS\"),mdx(\"p\",null,\"Die Erweiterung berechnet auch die Anzahl der registrierten Feuerpixel.\"),mdx(\"h4\",e({},{id:\"qgis2web\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#qgis2web\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"qgis2web\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1014_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.14a - Das qgis2web Plugin\"),mdx(\"p\",null,\"Bei qgis2web handelt es sich um eine Erweiterung, mit der Benutzer:innen QGIS-Projekte als \",mdx(\"strong\",{parentName:\"p\"},\"Webkarte\"),\" exportieren k\\xF6nnen.\"),mdx(\"p\",null,\"Eine Webkarte ist eine interaktive Darstellung von geografischen Informationen, die in Browsern ge\\xF6ffnet werden kann. Wir interagieren t\\xE4glich mit solchen Darstellungen, man denke nur an OpenStreetMap, Google Maps, Waze, etc.\"),mdx(\"p\",null,\"Dieses Plugin erm\\xF6glicht uns, sehr schnell eine Karte vorzubereiten und zu exportieren, die im Internet ver\\xF6ffentlicht werde kann. Dies funktioniert \\xFCber die Web-Technologien von \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://openlayers.org/\"}),\"OpenLayer3\"),\" oder \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://leafletjs.com/\"}),\"Leaflet\"),\". Qgis2web tut sein Bestes, um ein QGIS-Projekt zu interpretieren und HTML, Javascript und CSS zu exportieren, um eine Webkarte zu erstellen, die so nah wie m\\xF6glich am QGIS-Projekt ist.\"),mdx(\"p\",null,\"Nach der Installation des qgis2web-Plugins erscheint ein neues Icon in der QGIS-Symbolleiste, wie es auch im Plugin-Manager abgebildet ist. Wenn Sie darauf klicken, \\xF6ffnet sich ein Fenster, wie in Abbildung 10.14b.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1014_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.14b - Ausw\\xE4hlen, was Ihre Karte im Browser zeigen soll.\"),mdx(\"p\",null,'Die Benutzeroberfl\\xE4che ist intuitiv, aber bedenken Sie, je gr\\xF6\\xDFer die Datens\\xE4tze sind, desto l\\xE4nger dauert die Vorbereitung und der Export. Nachdem Sie ausgew\\xE4hlt haben, wohin exportiert werden soll, klicken Sie auf den Button \"Export\", um den Vorgang abzuschlie\\xDFen (siehe Abbildung 10.14c).'),mdx(\"p\",null,\"Der exportierte Ordner enth\\xE4lt mehrere Dateien, je nachdem, welche WebMapping-Technologie gew\\xE4hlt wurde - Leaflet oder Openlayers3. Ein Doppelklick auf die Datei index.html \\xF6ffnet die exportierte Karte in Ihrem Browser (siehe Abbildung 10.14d).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1014_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.14d - \\xD6ffnen der Datei index.html in Ihrem Browser\"),mdx(\"p\",null,\"Eine detaillierte Beschreibung der F\\xE4higkeiten des Plugins, zusammen mit einem umfassenderen Tutorial, finden Sie auf der qgis2web \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/tomchadwin/qgis2web\"}),\"Website (englischsprachig)\"),\".\"),mdx(\"h4\",e({},{id:\"dataplotly\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#dataplotly\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"DataPlotly\"),mdx(\"h4\",e({},{id:\"datenplotly\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#datenplotly\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"DatenPlotly\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1015_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.14a - Das DataPlotly-Plugin\"),mdx(\"p\",null,\"Das DataPlotly-Plugin wurde speziell entwickelt, um interaktive Graphen der geladenen Vektordaten in QGIS zu unterst\\xFCtzen. Das Plugin basiert auf einer Python-Bibliothek namens Plotly, die sehr leistungsf\\xE4hig ist und die M\\xF6glichkeit bietet, eine Vielzahl von interaktiven Diagrammen zu erstellen: Liniendiagramme, Streudiagramme, Fl\\xE4chendiagramme, Balkendiagramme, Fehlerbalken, Boxplots, Histogramme, Heatmaps, Subplots, mehrere Achsen, Polardiagramme und Blasendiagramme. Weitere Informationen zu dieser speziellen py-Bibliothek finden Sie auf der offiziellen \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://plotly.com/python/\"}),\"Website\"),\".\"),mdx(\"p\",null,\"Installieren Sie das Plugin \\xFCber den Plugin-Manager und laden Sie einige Vektorlayer zur Visualisierung. In den Screenshots werden wir uns wieder auf das Beispiel von den Philippinen beziehen, Sie k\\xF6nnen aber auch hier wieder analog f\\xFCr Mittelsachsen vorgehen (nutzen Sie daf\\xFCr die Daten aus Modul 8). Laden Sie zwei unterschiedliche Layer:\"),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Wasserstra\\xDFen (Linien);\"),mdx(\"li\",{parentName:\"ul\"},\"Besiedelte Orte (Punkte);\")),mdx(\"p\",null,\"Lassen Sie uns ein interaktives Diagramm vorbereiten, das zeigt, wie viele Fl\\xFCsse vs. Kan\\xE4le vs. B\\xE4che vs. Abwasserkan\\xE4le wir in unserem Datensatz haben.\"),mdx(\"p\",null,\"Wenn Sie auf das jeweilige Piktogramm klicken, \\xF6ffnet sich ein neues Fenster, siehe Abbildung 10.24.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15b - DataPlotly-Fenster/Panel.\"),mdx(\"p\",null,\"Als n\\xE4chstes stellen Sie die Parameter ein, wie in Abbildung 10.15c.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15c - Einrichten der Parameter f\\xFCr das Kreisdiagramm, das die Arten von Wasserstra\\xDFen darstellt\"),mdx(\"p\",null,\"W\\xE4hlen Sie den Wasserwege-Vektorlayer, aus dem die geplotteten Daten extrahiert werden sollen, Grouping field - fclass, Y-field - length. Um sicherzustellen, dass alle Segmente eine L\\xE4nge haben, gehen Sie in die Attributtabelle des Vektorlayers und erstellen Sie mit dem Feldrechner eine neue Spalte mit der Formel \",mdx(\"inlineCode\",{parentName:\"p\"},\"round($length)\"),\" wie Sie es auch schon in Modul 8 gelernt haben. W\\xE4hlen Sie anschlie\\xDFend beim Plot-Typ 'Singe Plot' und klicken Sie unten rechts auf die Schaltfl\\xE4che 'Create Plot'. Ihr Ergebnis sollte wie in Abbildung 10.15d aussehen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15d - Kreisdiagramm der Wasserstra\\xDFenarten nach L\\xE4nge.\"),mdx(\"p\",null,\"Wenn Sie mit der Maus \\xFCber jedes Kreisdiagrammsegment fahren, erscheint ein Popup-Fenster, das den Namen (aus der Spalte fclass), die Summe der L\\xE4ngen und den prozentualen Anteil an der Gesamtsumme anzeigt.\"),mdx(\"p\",null,\"Eine wichtige Funktionalit\\xE4t von DataPlotly ist die Verbindung mit der QGIS Kartenansicht. Klicken Sie auf einen der Abschnitte des Kreisdiagramms und Sie sollten sehen, dass einige Features \",mdx(\"strong\",{parentName:\"p\"},\"automatisch\"),\" in der Kartenansicht ausgew\\xE4hlt werden (siehe Abbildung 10.15e).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15e - Hervorhebung von Daten in DataPlotly und der Kartenansicht\"),mdx(\"p\",null,\"Das bedeutet auch, dass Sie Ihren Plot interaktiv aktualisieren k\\xF6nnen, um z. B. nur die ausgew\\xE4hlten Features anzuzeigen. Um das zu testen, markieren Sie nur einen Teil der Wasserstra\\xDFen in Ihrer Kartenansicht, dann gehen Sie in DataPlotly auf den ersten Reiter und setzen bei den Plot-Parametern ein H\\xE4kchen bei der Option 'only selected features' (siehe Abbildung 10.15f).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_f.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15f - Interaktives Aktualisieren des Plots, um nur ausgew\\xE4hlte Features anzuzeigen.\"),mdx(\"p\",null,'Klicken Sie anschlie\\xDFend auf die Schaltfl\\xE4che \"Update plot\". Das Ergebnis sollte ungef\\xE4hr so aussehen wie in Abbildung 10.29.'),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_g.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15g - Aktualisieren Sie den Plot, um nur die ausgew\\xE4hlten Features auf der Kartenleinwand anzuzeigen.\"),mdx(\"p\",null,\"Dar\\xFCber hinaus bietet DataPlotly eine Exportfunktion - entweder in eine .pdf-Datei oder in eine .html-Datei. Die entsprechenden Schaltfl\\xE4chen befinden sich am unteren, rechten Rand des DataPlotly-Fensters, siehe Abbildung 10.15h.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_h.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15h - Exportm\\xF6glichkeiten von DataPlotly\"),mdx(\"p\",null,\"Der Export als HTML-Datei erm\\xF6glicht es, eine Vielzahl von Datenplots f\\xFCr die Ver\\xF6ffentlichung im Internet vorzubereiten (siehe Abbildung 10.15i).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_i.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15i - Verwendung eines Browsers zum \\xD6ffnen der von DataPlotly exportierten HTML-Datei.\"),mdx(\"p\",null,\"Das Plugin ist auch sehr gut dokumentiert und es gibt ein Hilfemen\\xFC f\\xFCr jeden Plot-Typ. Sie k\\xF6nnen darauf zugreifen, indem Sie auf den vierten Reiter in DataPlotly klicken (siehe Abbildung 10.15j).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_j.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15j - Hilfemen\\xFC f\\xFCr jeden Plot-Typ, das \\xFCber das Plugin-Fenster zug\\xE4nglich ist.\"),mdx(\"p\",null,'Durch die direkte, interaktive Verkn\\xFCpfung mit den in QGIS geladenen Datens\\xE4tzen k\\xF6nnen beim Erstellen eines Plots auch Ausdr\\xFCcke verwendet werden. Um diese F\\xE4higkeit zu testen, werden wir einen Plot auf Basis des Vektorlayers \"Besiedelte Orte\" erstellen. Stellen Sie die folgenden Parameter ein: Typ: Balkenplot, Layer: Besiedelte Orte, X_Feld: is_in, Y_Feld - \\xF6ffnen Sie den Feldrechner und f\\xFCgen Sie ',mdx(\"inlineCode\",{parentName:\"p\"},'\"Bev\\xF6lkerung\" ist nicht null '),\" ein (siehe Abbildung 10.15k und Abbildung 10.15l).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_k.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15k - \\xD6ffnen des Feldeditors in DataPlotly basierend auf Attributen des ausgew\\xE4hlten QGIS-Layers, um einen Ausdruck zur Filterung dessen, was der Plot anzeigen wird, anzuwenden\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_l.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15l - Einf\\xFCgen eines Ausdrucks in den Feldrechner\"),mdx(\"p\",null,\"Das Ergebnis sollte wie in Abbildung 10.35 aussehen. .\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_m.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15m - DataPlotly-Ergebnis der Filterung nach Ausdruck\"),mdx(\"p\",null,\"Wenn wir diesen Plot interpretieren sollen, zeigt er uns, dass unter allen Provinzen, in denen besiedelte Orte registriert wurden, das Attribut Bev\\xF6lkerung nur in 3 Regionen \\xFCberhaupt gesetzt ist: Alaminos, Sual, und Bagac. Man kann diese Schlussfolgerung leicht testen, indem man in die Attributtabelle schaut.\"),mdx(\"p\",null,\"DataPlotly bietet auch die M\\xF6glichkeit, Subplots zu erstellen, was bedeutet, dass mehrere Plots in einer einzigen Abbildung dargestellt werden k\\xF6nnen.\"),mdx(\"p\",null,'Um diese Funktionalit\\xE4t zu testen, werden wir den Vektorlayer \"Besiedelte Orte\" verwenden. Wir haben die folgenden Attribute von Interesse: ',mdx(\"inlineCode\",{parentName:\"p\"},\"place\"),\" = Typ des Ortes (Stadt, Dorf, etc.), \",mdx(\"inlineCode\",{parentName:\"p\"},\"is_in\"),\" = Name der n\\xE4chstgr\\xF6\\xDFeren Verwaltungseinheit, zu der er geh\\xF6rt (falls bekannt), \",mdx(\"inlineCode\",{parentName:\"p\"},\"population\"),\" = (Bev\\xF6lkerungszahl) und \",mdx(\"inlineCode\",{parentName:\"p\"},\"name\"),\" = der Name des Ortes. Wir werden in der gleichen Abbildung zwei Datendiagramme integrieren: eines, um uns zu zeigen, wie viele der besiedelten Orte in jede Kategorie von \",mdx(\"inlineCode\",{parentName:\"p\"},\"place\"),\" fallen und das zweite, wie sich die Bev\\xF6lkerung auf die 4 Arten von \",mdx(\"inlineCode\",{parentName:\"p\"},\"place\"),\" aufteilt.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_n.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15n - Einstellen der Parameter f\\xFCr die erste Darstellung - Siedlungstypen nach ihrer Anzahl\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_o.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abb. 10.15o - Einstellen der Parameter f\\xFCr das zweite Diagramm - Siedlungstypen nach Einwohnerzahlen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1015_p.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.15p - Subplots in einer Reihe\"),mdx(\"p\",null,\"Eine ausf\\xFChrliche Beschreibung der M\\xF6glichkeiten des Plugins sowie ein umfassenderes Tutorial finden Sie auf der DataPlotly \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/ghtmtt/DataPlotly\"}),\"Website (englischsprachig)\"),\".\"),mdx(\"h4\",e({},{id:\"quickmapservices--openlayers\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#quickmapservices--openlayers\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"QuickMapServices / OpenLayers\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1016_a1.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1016_a2.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.16a - QuickMapServices-Erweiterung; 10.16b - OpenLayers-Erweiterung\"),mdx(\"p\",null,\"Diese beiden Erweiterungen sind au\\xDFerordentlich n\\xFCtzlich, wenn Sie Basiskarten zu Ihrem QGIS-Projekt hinzuf\\xFCgen m\\xF6chten. So ein Basislayer hilft zum Beispiel, um die korrekte Positionierung eines neu Vektorlayers zu \\xFCberpr\\xFCfen. QuickMapServices erlabut es uns, mit nur 2 Klicks Basiskarten-Layer von verschiedenen Anbietern, wie OpenStreetMap, NASA, Bing oder Google Maps, in seinen Desktop-Client zu laden.\"),mdx(\"p\",null,'Installieren Sie beide Erweiterungen \\xFCber die Erweiterungsverwaltung. Die Erweiterungen erscheinen dann im Men\\xFC unter \"Web\" (siehe Abbildung 10.16b).'),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1016_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.16b - Men\\xFCs der Erweiterungen QuickMapServices und OpenLayers.\"),mdx(\"p\",null,\"Die Verwendung dieser Plugins ist ziemlich einfach: Sie klicken einfach auf den Layer, den Sie in Ihre Kartenansicht bringen m\\xF6chten, und die Erweiterung macht den Rest.\"),mdx(\"p\",null,\"Abbildung 10.16c zeigt die Stamen Toner Karte als Basiskarte f\\xFCr einige der in Modul 8 und 9 verwendeten Daten aus Mittelsachsen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1016_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.16c - Verwendung der OpenLayers-Erweiterung.\"),mdx(\"p\",null,\"Abbildung 10.16d zeigt die perfekte Ausrichtung der in die QGIS Kartenansicht geladenen Basiskarte unter Verwendung der OpenLayers Erweiterung. Obwohl die 2 Layer nicht in der gleichen Projektion sind, erlaubt QGIS eine Projektion on-the-fly, so dass eine \\xDCberlagerung m\\xF6glich ist. Hier sehen wir auch, dass die Stamen Toner Karte eine relativ reduzierte Ansicht nutzt und viele der kleineren Stra\\xDFen in der Darstellung ausl\\xE4sst.\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1016_d.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.16d - Geladene Vektordaten (Stra\\xDFen), \\xFCberlagert mit einer Stamen Basiskarte\"),mdx(\"p\",null,\"Eine detaillierte Beschreibung der F\\xE4higkeiten der Erweiterungen sowie ein umfassenderes Tutorial finden Sie auf deren (englischsprachigen) Webseite: \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://nextgis.com/blog/quickmapservices/\"}),\"QuickMapServices\"),\" und \",mdx(\"a\",e({parentName:\"p\"},{href:\"https://github.com/sourcepole/qgis-openlayers-plugin\"}),\"OpenLayer Plugin\"),\".\"),mdx(\"h4\",e({},{id:\"table-to-style\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#table-to-style\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"Table to Style\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1017_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.17a - Das Table to Style-Plugin\"),mdx(\"p\",null,\"Dieses Plugin ist n\\xFCtzlich f\\xFCr Situationen, in denen Sie einen Rasterdatensatz haben, in dem bestimmte Pixelwerte zur Kategorisierung von Daten genutzt werden. Wir kennen das aus dem Modul 9 in dem wir mit den Landbedeckungsdaten gearbeitet haben (siehe Abbildung 10.17b).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.17b - Beispielhafte Situationen, in denen Pixelwerte einen Wert kategorisieren\"),mdx(\"p\",null,\"Vom Anbieter dieses Produkts, das auf Satellitenbildern basiert, werden auch die Pixelwerte und die zugeh\\xF6rigen Farben zur Verf\\xFCgung gestellt:\"),mdx(\"table\",null,mdx(\"tr\",null,mdx(\"td\",null,mdx(\"strong\",null,\"Value\")),mdx(\"td\",null,mdx(\"strong\",null,\"Color\")),mdx(\"td\",null,mdx(\"strong\",null,\"Description\"))),mdx(\"tr\",null,mdx(\"td\",null,\"0\"),mdx(\"td\",null,\"#282828\"),mdx(\"td\",null,\"Unknown. No or not enough satellite data available.\")),mdx(\"tr\",null,mdx(\"td\",null,\"20\"),mdx(\"td\",null,\"#FFBB22\"),mdx(\"td\",null,\"Shrubs. Woody perennial plants with persistent and woody stems and without any defined main stem being less than 5 m tall. The shrub foliage can be either evergreen or deciduous.\")),mdx(\"tr\",null,mdx(\"td\",null,\"30\"),mdx(\"td\",null,\"#FFFF4C\"),mdx(\"td\",null,\"Herbaceous vegetation. Plants without persistent stem or shoots above ground and lacking definite firm structure. Tree and shrub cover is less than 10 %.\")),mdx(\"tr\",null,mdx(\"td\",null,\"40\"),mdx(\"td\",null,\"#F096FF\"),mdx(\"td\",null,\"Cultivated and managed vegetation / agriculture. Lands covered with temporary crops followed by harvest and a bare soil period (e.g., single and multiple cropping systems). Note that perennial woody crops will be classified as the appropriate forest or shrub land cover type.\")),mdx(\"tr\",null,mdx(\"td\",null,\"50\"),mdx(\"td\",null,\"#FA0000\"),mdx(\"td\",null,\"Urban / built up. Land covered by buildings and other man-made structures.\")),mdx(\"tr\",null,mdx(\"td\",null,\"60\"),mdx(\"td\",null,\"#B4B4B4\"),mdx(\"td\",null,\"Bare / sparse vegetation. Lands with exposed soil, sand, or rocks and never has more than 10 % vegetated cover during any time of the year.\")),mdx(\"tr\",null,mdx(\"td\",null,\"70\"),mdx(\"td\",null,\"#F0F0F0\"),mdx(\"td\",null,\"Snow and ice. Lands under snow or ice cover throughout the year.\")),mdx(\"tr\",null,mdx(\"td\",null,\"80\"),mdx(\"td\",null,\"#0032C8\"),mdx(\"td\",null,\"Permanent water bodies. Lakes, reservoirs, and rivers. Can be either fresh or salt-water bodies.\")),mdx(\"tr\",null,mdx(\"td\",null,\"90\"),mdx(\"td\",null,\"#0096A0\"),mdx(\"td\",null,\"Herbaceous wetland. Lands with a permanent mixture of water and herbaceous or woody vegetation. The vegetation can be present in either salt, brackish, or fresh water.\")),mdx(\"tr\",null,mdx(\"td\",null,\"100\"),mdx(\"td\",null,\"#FAE6A0\"),mdx(\"td\",null,\"Moss and lichen.\")),mdx(\"tr\",null,mdx(\"td\",null,\"111\"),mdx(\"td\",null,\"#58481F\"),mdx(\"td\",null,\"Closed forest, evergreen needle leaf. Tree canopy >70 %, almost all needle leaf trees remain green all year. Canopy is never without green foliage.\")),mdx(\"tr\",null,mdx(\"td\",null,\"112\"),mdx(\"td\",null,\"#009900\"),mdx(\"td\",null,\"Closed forest, evergreen broad leaf. Tree canopy >70 %, almost all broadleaf trees remain green year round. Canopy is never without green foliage.\")),mdx(\"tr\",null,mdx(\"td\",null,\"113\"),mdx(\"td\",null,\"#70663E\"),mdx(\"td\",null,\"Closed forest, deciduous needle leaf. Tree canopy >70 %, consists of seasonal needle leaf tree communities with an annual cycle of leaf-on and leaf-off periods.\")),mdx(\"tr\",null,mdx(\"td\",null,\"114\"),mdx(\"td\",null,\"#00CC00\"),mdx(\"td\",null,\"Closed forest, deciduous broad leaf. Tree canopy >70 %, consists of seasonal broadleaf tree communities with an annual cycle of leaf-on and leaf-off periods.\")),mdx(\"tr\",null,mdx(\"td\",null,\"115\"),mdx(\"td\",null,\"#4E751F\"),mdx(\"td\",null,\"Closed forest, mixed.\")),mdx(\"tr\",null,mdx(\"td\",null,\"116\"),mdx(\"td\",null,\"#007800\"),mdx(\"td\",null,\"Closed forest, not matching any of the other definitions.\")),mdx(\"tr\",null,mdx(\"td\",null,\"121\"),mdx(\"td\",null,\"#666000\"),mdx(\"td\",null,\"Open forest, evergreen needle leaf. Top layer- trees 15-70 % and second layer- mixed of shrubs and grassland, almost all needle leaf trees remain green all year. Canopy is never without green foliage.\")),mdx(\"tr\",null,mdx(\"td\",null,\"122\"),mdx(\"td\",null,\"#8DB400\"),mdx(\"td\",null,\"Open forest, evergreen broad leaf. Top layer- trees 15-70 % and second layer- mixed of shrubs and grassland, almost all broadleaf trees remain green year round. Canopy is never without green foliage.\")),mdx(\"tr\",null,mdx(\"td\",null,\"123\"),mdx(\"td\",null,\"#8D7400\"),mdx(\"td\",null,\"Open forest, deciduous needle leaf. Top layer- trees 15-70 % and second layer- mixed of shrubs and grassland, consists of seasonal needle leaf tree communities with an annual cycle of leaf-on and leaf-off periods.\")),mdx(\"tr\",null,mdx(\"td\",null,\"124\"),mdx(\"td\",null,\"#A0DC00\"),mdx(\"td\",null,\"Open forest, deciduous broadleaf. Top layer- trees 15-70 % and second layer- mixed of shrubs and grassland, consists of seasonal broadleaf tree communities with an annual cycle of leaf-on and leaf-off periods.\")),mdx(\"tr\",null,mdx(\"td\",null,\"125\"),mdx(\"td\",null,\"#929900\"),mdx(\"td\",null,\"Open forest, mixed.\")),mdx(\"tr\",null,mdx(\"td\",null,\"126\"),mdx(\"td\",null,\"#648C00\"),mdx(\"td\",null,\"Open forest, not matching any of the other definitions.\")),mdx(\"tr\",null,mdx(\"td\",null,\"200\"),mdx(\"td\",null,\"#000080\"),mdx(\"td\",null,\"Oceans, seas. Can be either fresh or salt-water bodies.\"))),mdx(\"p\",null,\"Wenn ein neuer Datensatz - Raster oder Vektor - geladen wird, weist QGIS ihm eine zuf\\xE4llige visuelle Darstellung zu. Es liegt an den Benutzer:innen, geeignete Farben und Stylisierungen der Daten zu definieren. Weitere Informationen zum Styling von Layern finden Sie in Modul 4.\"),mdx(\"p\",null,\"Um das Table to Style Plugin zu testen, verwenden wir den Rasterdatensatz LandCover2019, der auch in Modul Nr. 9 verwendet wird. Wenn Sie das Raster in QGIS laden, sollten Sie eine \\xE4hnliche Darstellung wie in Abbildung 10.17c erhalten.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.17c - QGIS ordnet den Pixelwerten zuf\\xE4llig Farben zu\"),mdx(\"p\",null,\"Vom Datenanbieter wissen wir, dass es f\\xFCr jeden Pixelwert eine eindeutig zugewiesene Farbe gibt und im Bereich Landbedeckung stellen diese Farben bereits Konventionen dar, genau wie in der klassischen Kartographie. W\\xE4lder werden mit einer bestimmten Art von Gr\\xFCn dargestellt, Weiden mit einer anderen, Meer wird mit einer anderen Art von Blau dargestellt als Binnengew\\xE4sser und so weiter. Im schlimmsten Fall m\\xFCsste man alle diese Farben manuell zuordnen. Das Table to Style Plugin l\\xF6st dieses Problem jedoch automatisch und in Sekundenschnelle.\"),mdx(\"p\",null,\"Gehen Sie in die Erweiterungsverwaltung und installieren Sie das Table to Style Plugin. Es erscheint ein neues Symbol in Ihrer Symbolleiste. Wenn Sie es \\xF6ffnen, sollte ein Einstellungsfenster erscheinen, wie in Abbildung 10.17d.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.17d - Table2style-Fenster\"),mdx(\"p\",null,\"Das Plugin ben\\xF6tigt 2 Parameter - eine Rasterebene und eine Attributtabelle mit Pixelwerten, Beschriftung und Farbcodes in einem der drei Systeme: RGB, HSV oder Hex. In unserer Tabelle oben haben wir Hex-Codes f\\xFCr die zugeordneten Farben. Laden Sie die CSV-Datei wie gewohnt als Layer - die Daten haben dabei nat\\xFCrlich keine Geometrie. Die Tabelle der LandCover-Werte sollte wie in Abbildung 10.17e aussehen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_e.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Bild 10.17e - Attributtabelle mit Pixelwerten, Farbcodes und Beschreibung f\\xFCr Land Cover\"),mdx(\"p\",null,\"Werfen wir nun einen Blick auf den Rasterdatensatz. Die Table to Style Erweiterung funktioniert nur bei einem 1-Band-Raster, da es sich um eine 1 zu 1 Verbindung handelt: Pixelwert - Farbcode. Wenn mehr Kan\\xE4le vorhanden w\\xE4ren, w\\xFCsste nicht, welches es w\\xE4hlen sollte. Wenn wir jedoch die Eigenschaften der Ebene LandCover2019 \\xFCberpr\\xFCfen, stellen wir fest, dass es 3 Kan\\xE4le gibt (\",mdx(\"inlineCode\",{parentName:\"p\"},\"Eigenschaften - Informationen - nach unten zu B\\xE4nder scrollen\"),'). Da wir nur Kanal 1 - discrete_classification - ben\\xF6tigen, werden wir den Raster Calculator verwenden, um es zu extrahieren. F\\xFCgen Sie dort im Ausdrucksfeld nur \"LandCover2019@1\" ein. Weitere Details zur Arbeit mit Rastern finden Sie in Modul 9.'),mdx(\"p\",null,\"Jetzt haben wir alles, was wir brauchen, um das Plugin zu testen. Stellen Sie die Parameter wie in Abbildung 10.17f ein.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_f.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.17f - Einstellen der Parameter des Table to Style Plugins f\\xFCr den Datensatz LandCover_2019-Band-1\"),mdx(\"p\",null,\"Das Ergebnis sollte wie in Abbildung 10.17g aussehen.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1017_g.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.17g - Automatisch gestylter Rasterdatensatz mit Table to Style -Plugin\"),mdx(\"p\",null,\"Eine ausf\\xFChrliche Beschreibung der F\\xE4higkeiten des Plugins sowie ein umfassenderes Tutorial finden Sie auf der Webseite des Plugins Table 2 Style.\"),mdx(\"h4\",e({},{id:\"ors-tool\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#ors-tool\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),\"ORS Tool\"),mdx(\"p\",null,mdx(\"img\",e({parentName:\"p\"},{src:\"/giscurriculum/images/de/module10/media/fig1018_a.png\",alt:\"alt_text\",title:\"image_tooltip\"}))),mdx(\"p\",null,\"Bild 10.48a - Das ORS Tools-Plugin\"),mdx(\"p\",null,\"In unserer letzten Erweiterungen wollen wir Ihnen die M\\xF6glichkeiten der vernetzten Welt der GIS-Daten, -Tools und -Dienste zu zeigen. Wir haben bereits gesehen, dass es Erweiterungen gibt, die uns dabei helfen k\\xF6nnen, unsere QGIS-Daten von anderen Anbietern zu laden, ohne dass wir sie m\\xFChsam herunterladen, speichern und \\xF6ffnen m\\xFCssen (OpenLayers-Plugin , Active Fire). Die Erweiterung ORS Tools wurde jedoch entwickelt, um den Zugriff auf einen externen Routing-Dienst zu erm\\xF6glichen - den openrouteservice.org, der auf OpenStreetMap basiert.\"),mdx(\"p\",null,mdx(\"strong\",{parentName:\"p\"},\"Routing\"),\" ist der Prozess der Auswahl eines Pfades f\\xFCr den Verkehr in einem Netzwerk oder zwischen oder \\xFCber mehrere ausgew\\xE4hlte Punkte.\"),mdx(\"p\",null,\"Die Erweiterung erm\\xF6glicht Routing, Isochronen und Matrixberechnungen, entweder interaktiv in der Kartenansicht oder aus Punktdateien innerhalb des Verarbeitungsrahmens.\"),mdx(\"p\",null,'Installieren Sie mit der Erweiterungsverwaltung das Plugin \"ORS Tools\". Ein neues Piktogramm erscheint in Ihrer Werkzeugleiste. Doppelklicken Sie darauf, um es zu \\xF6ffnen (siehe Abbildung 10.18b).'),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_b.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,'Abbildung 10.18b - Fenster \"ORS Tools\" \\xF6ffnen.'),mdx(\"p\",null,\"Wie bereits erw\\xE4hnt, verwendet diese Erweiterung eine externe Datenbank - OpenStreetMap - und externe Algorithmen, die in einen Dienst - openrouteservice - angeboten werden. Um eine Verbindung zu diesem externen Dienst herstellen zu k\\xF6nnen, m\\xFCssen wir ein Konto auf deren Webseite erstellen und einen \",mdx(\"strong\",{parentName:\"p\"},\"API-Key anfordern\"),\".\"),mdx(\"p\",null,\"Ein API-Schl\\xFCssel/API-Key/API-Token ist eine eindeutige Kennung, die zur Authentifizierung gegen\\xFCber einer API verwendet wird. Die API ist wie Zugang zum Innenleben einer Software, ein programmatischer Zugang zu deren Prozessen und Algorithmen. Um also den openrouteservice durch QGIS zu nutzen, werden wir nach einem \",mdx(\"em\",{parentName:\"p\"},\"Schl\\xFCssel\"),\" fragen.\"),mdx(\"p\",null,\"Fahren Sie mit den folgenden Schritten fort:\"),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"Klicken Sie auf die Schaltfl\\xE4che Sign Up im Fenster ORS Tools (Abbildung 10.49).\",mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_c.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}))),mdx(\"p\",null,'Bild 10.18c - Schaltfl\\xE4che \"Sign in\"'),mdx(\"ol\",e({},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"Legen Sie auf der ge\\xF6ffneten openrouteservice-Website ein kostenloses Konto an.\",mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}))),mdx(\"p\",null,\"Bild 10.18d - Openrouteservice-Kontoseite\"),mdx(\"ol\",e({},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"Nach dem Anlegen des Kontos erhalten Sie eine E-Mail, die Sie \\xFCber den soeben erhaltenen kostenlosen Zugang informiert.\",mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_d.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.18e - E-Mail von openrouteservice erhalten\"),mdx(\"ol\",e({},{start:4}),mdx(\"li\",{parentName:\"ol\"},\"Melden Sie sich an Ihrem neu erstellten Konto an und fordern Sie ein Token an.\",mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_f.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}))),mdx(\"p\",null,\"Bild 10.18f - openrouteservice-Token anfordern\"),mdx(\"ol\",e({},{start:5}),mdx(\"li\",{parentName:\"ol\"},\"Nachdem Ihr Token erstellt wurde, klicken Sie auf die lange alphanumerische Zeichenfolge unterhalb des Namensschl\\xFCssels. Es erscheint eine Meldung, dass es kopiert wurde.\"),mdx(\"li\",{parentName:\"ol\"},\"Kehren Sie zu QGIS zur\\xFCck und f\\xFCgen Sie den kopierten API-Schl\\xFCssel ein.\",mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_g.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}))),mdx(\"p\",null,\"Abbildung 10.18g - Einf\\xFCgen des openrouteserviceAPI-Schl\\xFCssels in Ihr QGIS\"),mdx(\"p\",null,\"An diesem Punkt sollte Ihr QGIS bereit sein, Routen mit openrouteservice und OpenStreetMap zu berechnen. Um die grundlegenden F\\xE4higkeiten zu testen, laden Sie den Layer der Geb\\xE4ude aus Mittelsachsen. Stellen Sie sicher, dass Sie in EPSG:3857 arbeiten - hierf\\xFCr kann es n\\xF6tig sein, dass Sie den Geb\\xE4udelayer voerst in das KBS EPSG:5650 reporojizieren. Nachdem Sie den Layer geladen haben, beginnen Sie mit dem Einf\\xFCgen der Routingpunkte. \\xD6ffnen Sie die ORS-Tools, und dr\\xFCcken Sie die gr\\xFCne + Taste (siehe Abbildung 10.18h).\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_h.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Bild 10.18h - Einf\\xFCgen der Routingpunkte mit den ORS-Tools.\"),mdx(\"p\",null,\"W\\xE4hlen Sie den Routing-Algorithmus Traveling Salesman und klicken Sie auf Anwenden. Nach wenigen Augenblicken ist ein neuer Vektor-Layer erstellt worden: Routes_ORS.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_i.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.18i - Ergebnis der Ausf\\xFChrung der ORS Tools.\"),mdx(\"img\",{src:\"/giscurriculum/images/de/module10/media/fig1018_j.png\",style:{width:\"100%\",maxWidth:\"75vw\"},alt:\"image_tooltip\"}),mdx(\"p\",null,\"Abbildung 10.18j - Die berechnete Route, mit eine OpenStreetMap Hintergrundkarte\"),mdx(\"p\",null,\"Die Ergebnisse der ORS-Tools h\\xE4ngen stark von der Qualit\\xE4t der verwendeten Datenbanken ab, in diesem Fall - der OpenStreetMap.\"),mdx(\"p\",null,\"Die Erweiterung, wie auch der openroutingservice, hat noch mehr zu bieten, aber wir \\xFCberlassen es Ihnen, das auf Ihrer GIS-Reise zu entdecken.\"),mdx(\"h4\",e({},{id:\"quizfragen-1\"}),mdx(\"a\",e({parentName:\"h4\"},{\"aria-hidden\":\"true\",tabIndex:-1,href:\"#quizfragen-1\"}),mdx(\"span\",e({parentName:\"a\"},{className:\"icon icon-link\"}))),mdx(\"strong\",{parentName:\"h4\"},\"Quizfragen\")),mdx(\"ol\",null,mdx(\"li\",{parentName:\"ol\"},\"K\\xF6nnen QGIS-Erweiterungen au\\xDFerhalb der QGIS-Plattform betrieben werden?\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"Nein\")),mdx(\"li\",{parentName:\"ul\"},\"Ja\")),mdx(\"ol\",e({},{start:2}),mdx(\"li\",{parentName:\"ol\"},\"Um eine QGIS Erweiterung zu benutzen, muss man programmieren lernen.\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"Nein\")),mdx(\"li\",{parentName:\"ul\"},\"Ja\")),mdx(\"ol\",e({},{start:3}),mdx(\"li\",{parentName:\"ol\"},\"Es wird empfohlen, dass alle Erweiterungen \\xFCber die Erweiterungsverwaltung installiert werden, auch wenn sie durch Herunterladen der Zip-Datei und Ablegen im richtigen QGIS-Ordner installiert werden k\\xF6nnten.\")),mdx(\"ul\",null,mdx(\"li\",{parentName:\"ul\"},\"Nein\"),mdx(\"li\",{parentName:\"ul\"},mdx(\"em\",{parentName:\"li\"},\"Ja\"))))}MDXContent.isMDXComponent=!0;\n","scope":{"slug":"Germany","title":"Germany","language":"German","description":"Sanfte Einfhrung in GIS-Konzepte","date":"","author":"Ben Hur","prev":"/de/germany/module/module9","next":"","mods":["Sanfte Einfhrung in GIS-Konzepte[/de/germany/module/module0]","Einfhrung in QGIS[/de/germany/module/module1]","Ebenen in QGIS[/de/germany/module/module2]","OpenStreetMap und der High Resolution Settlement Layer[/de/germany/module/module3]","Layer-Styling[/de/germany/module/module4]","Karten erstellen[/de/germany/module/module5]","Layer-Attribute[/de/germany/module/module6]","Erstellen und Bearbeiten von Layern[/de/germany/module/module7]","Vector Processing and Analysis[/de/germany/module/module8]","Rasterverarbeitung und -analyse[/de/germany/module/module9]","QGIS-Erweiterungen / -Plugins[/de/germany/module/module10]"],"outlines":["Pdagogische Einfhrung","Zustzliche Ressourcen"]}},"frontMatter":{"slug":"Germany","title":"Germany","language":"German","description":"Sanfte Einfhrung in GIS-Konzepte","date":"","author":"Ben Hur","prev":"/de/germany/module/module9","next":"","mods":["Sanfte Einfhrung in GIS-Konzepte[/de/germany/module/module0]","Einfhrung in QGIS[/de/germany/module/module1]","Ebenen in QGIS[/de/germany/module/module2]","OpenStreetMap und der High Resolution Settlement Layer[/de/germany/module/module3]","Layer-Styling[/de/germany/module/module4]","Karten erstellen[/de/germany/module/module5]","Layer-Attribute[/de/germany/module/module6]","Erstellen und Bearbeiten von Layern[/de/germany/module/module7]","Vector Processing and Analysis[/de/germany/module/module8]","Rasterverarbeitung und -analyse[/de/germany/module/module9]","QGIS-Erweiterungen / -Plugins[/de/germany/module/module10]"],"outlines":["Pdagogische Einfhrung","Zustzliche Ressourcen"]},"isInRequestedLanguage":true,"_nextI18Next":{"initialI18nStore":{"de":{"countrylevel":{"language":"SPRACHE","region":"REGION","next":"Nchste","back":"Zurck","content_page":"Inhaltsseite","outlines":"Umrisse","content_menu":"Inhaltsmen"}},"en":{"countrylevel":{"language":"LANGUAGE","region":"REGION","next":"Next","back":"Back","content_page":"Content Page","outlines":"Outlines","content_menu":"Content Menu"}}},"initialLocale":"de","userConfig":{"i18n":{"defaultLocale":"en","locales":["en","es","de"],"defaultCountry":"bangladesh","countries":["bangladesh","ghana","nigeria","germany","argentina","mexico"]},"reloadOnPrerender":true,"default":{"i18n":{"defaultLocale":"en","locales":["en","es","de"],"defaultCountry":"bangladesh","countries":["bangladesh","ghana","nigeria","germany","argentina","mexico"]},"reloadOnPrerender":true}}}},"__N_SSG":true}